package org.example.lessons15.Materials

// 7. Четвёртый класс должен принимать словарь (ключи и значения строки).
//Каждая пара ключа и значения должна попадать в контейнер следующим образом - ключ в начало, значение в конец.
//Таким образом в начале должны быть ключи в обратном порядке, потом существующие материалы, потом все значения.

class DictionaryMaterials : Materials() {
    override fun addMaterials(dictionary: Map<String, String>) {
        dictionary.forEach { (key, value) ->
            // Ключ всегда добавляется в самое начало (индекс 0).
            // Так как мы идем по словарю, второй ключ встанет перед первым (обратный порядок).
            materials.add(0, key)

            // Значение добавляется в самый конец
            materials.add(value)
        }
    }
}