//package org.example.lesson12
//
////Реши задачи подходящим методом для работы с коллекцией. Для каждой задачи есть свой метод, не повторяйся.
//// Список методов в рекомендациях под заданиями.
//
////Задачи на приведение коллекции к значению
////1. Проверить, что размер коллекции больше 5 элементов.
//fun task1(numbers: List<Int>): Boolean = numbers.size > 5
//
////2. Проверить, что коллекция пустая
//fun task2(numbers: List<Int>): Boolean = numbers.isEmpty()
//
////3. Проверить, что коллекция не пустая
//fun task3(numbers: List<Int>): Boolean = numbers.isNotEmpty()
//
////4. Взять элемент по индексу или создать значение если индекса не существует
//fun task4(numbers: List<Int>, index: Int): Int = numbers.getOrElse(index) { -1 }
//
////5. Собрать коллекцию в строку
//fun task5(numbers: List<Int>): String = numbers.joinToString(separator = ", ")
//
////6. Посчитать сумму всех значений
//fun task6(numbers: List<Int>): Int = numbers.sum()
//
////7. Посчитать среднее
//fun task7(numbers: List<Int>): Double = numbers.average()
//
////8. Взять максимальное число
//fun task8(numbers: List<Int>): Int? = numbers.maxOrNull()
//
////9. Взять минимальное число
//fun task9(numbers: List<Int>): Int? = numbers.minOrNull()
//
////10. Взять первое число или null
//fun task10(numbers: List<Int>): Int? = numbers.firstOrNull()
//
////11. Проверить что коллекция содержит элемент
//fun task11(numbers: List<Int>, value: Int): Boolean = numbers.contains(value)
//
//
//// Реши задачи подходящим методом для работы с коллекцией. Для каждой задачи есть свой метод, не повторяйся.
//// Список методов в рекомендациях под заданиями.
//
//
////Задачи на обработку коллекций
////12. Отфильтровать коллекцию по диапазону 18-30
//fun task1(numbers: List<Int>): List<Int> = numbers.filter { it in 18..30 }
//
////13. Выбрать числа, которые не делятся на 2 и 3 одновременно
//fun task2(numbers: List<Int>): List<Int> = numbers.filterNot { it % 2 == 0 && it % 3 == 0 }
//
////14. Очистить текстовую коллекцию от null элементов
//fun task3(words: List<String?>): List<String> = words.filterNotNull()
//
////15. Преобразовать текстовую коллекцию в коллекцию длин слов
//fun task4(words: List<String>): List<Int> = words.map { it.length }
//
////16. Преобразовать текстовую коллекцию в мапу, где ключи - перевёрнутые слова, а значения - длина слов
//fun task5(words: List<String>): Map<String, Int> = words.associate { it.reversed() to it.length }
//
////17. Отсортировать список в алфавитном порядке
//fun task6(words: List<String>): List<String> = words.sorted()
//
////18. Взять первые 3 элемента списка
//fun task7(numbers: List<Int>): List<Int> = numbers.take(3)
//
////19. Распечатать квадраты элементов списка
//fun task8(numbers: List<Int>) = numbers.forEach { println(it * it) }
//
////20. Группировать список по первой букве слов
//fun task9(words: List<String>): Map<Char, List<String>> = words.groupBy { it.first() }
//
////21. Очистить список от дублей
//fun task10(numbers: List<Int>): List<Int> = numbers.distinct()
//
////22. Отсортировать список по убыванию
//fun task11(numbers: List<Int>): List<Int> = numbers.sortedDescending()
//
////23. Взять последние 3 элемента списка
//fun task12(numbers: List<Int>): List<Int> = numbers.takeLast(3)
//
//
//
////Реши задачи ниже в отдельных функциях.
////Задача 24. Характеристика числовой коллекции
////Напиши функцию, которая принимает коллекцию чисел и возвращает строку с характеристикой коллекции используя конструкцию when
////- Если коллекция пустая - “Пусто”
////- Если количество элементов меньше пяти - “Короткая”
////- Если коллекция начинается с 0 - “Стартовая”
////- Если сумма всех чисел больше 10000 - “Массивная”
////- Если среднее значение равно 10 - “Сбалансированная”
////- Если длина строки образованная склеиванием коллекции в строку равна 20 - “Клейкая”
////- Если максимальное число меньше -10 - “Отрицательная”
////- Если минимальное число больше 1000 - “Положительная”
////- Если содержит одновременно числа 3 и 14 - “Пи***тая”
////- Иначе - “Уникальная”
//// Вызвать метод с данными, подходящими под каждую из веток
//
//fun characterizeCollection(numbers: List<Int>): String = when {
//    // 1. Если коллекция пустая
//    numbers.isEmpty() -> "Пусто"
//
//    // 2. Если количество элементов меньше пяти
//    numbers.size < 5 -> "Короткая"
//
//    // 3. Если коллекция начинается с 0
//    numbers.firstOrNull() == 0 -> "Стартовая"
//
//    // 4. Если сумма всех чисел больше 10000
//    numbers.sum() > 10000 -> "Массивная"
//
//    // 5. Если среднее значение равно 10
//    numbers.average() == 10.0 -> "Сбалансированная"
//
//    // 6. Если длина строки, образованной склеиванием коллекции, равна 20
//    numbers.joinToString().length == 20 -> "Клейкая"
//
//    // 7. Если максимальное число меньше -10
//    numbers.maxOrNull()!! < -10 -> "Отрицательная"
//
//    // 8. Если минимальное число больше 1000
//    numbers.minOrNull()!! > 1000 -> "Положительная"
//
//    // 9. Если содержит одновременно числа 3 и 14
//    3 in numbers && 14 in numbers -> "Пи***тая"
//
//    // 10. Иначе
//    else -> "Уникальная"
//}
//
//fun main() {
//    // Пусто
//    println(characterizeCollection(emptyList()))
//
//    // Короткая
//    println(characterizeCollection(listOf(1)))
//
//    // Стартовая
//    println(characterizeCollection(listOf(0, 1, 2, 3, 4)))
//
//    // Массивная
//    println(characterizeCollection(listOf(1, 3000, 3000, 3000, 3000)))
//
//    // Сбалансированная
//    println(characterizeCollection(listOf(10, 10, 10, 10, 10)))
//
//    // Клейкая
//    println(characterizeCollection(listOf(100, 200, 30, 40, 50)))
//
//    // Отрицательная
//    println(characterizeCollection(listOf(-11, -12, -13, -14, -15)))
//
//    // Положительная
//    println(characterizeCollection(listOf(1001, 1002, 1003, 1004, 1005)))
//
//    // Пи***тая
//    println(characterizeCollection(listOf(3, 14, 1, 2, 4)))
//
//    // Уникальная
//    println(characterizeCollection(listOf(1, 2, 4, 5, 6)))
//}
//
//
//
////Задача 25. Анализ учебных оценок
////Напиши функцию, которая принимает список чисел и возвращает список чисел.
////Пример данных: val grades = listOf(85, 58, 90, 74, 88, 67, 95, 92, 50, 42, 12)
////Цель: Отфильтровать удовлетворительные оценки (>=60), отсортировать оставшиеся по возрастанию и взять первые 3.
////Вызывай методы обработки и фильтрации последовательно один из другого, чтобы результат предыдущего метода являлся основой для следующего.
//
//fun analyzeGrades(grades: List<Int>): List<Int> =
//    grades
//        .filter { it >= 60 }          // отфильтровать удовлетворительные оценки
//        .sorted()                     // отсортировать по возрастанию
//        .take(3)                  // взять первые 3
//
//fun main() {
//    val grades = listOf(85, 58, 90, 74, 88, 67, 95, 92, 50, 42, 12)
//    println(analyzeGrades(grades)) // [67, 74, 85]
//}
//
//
////Задача 26. Создание каталога по первой букве
////Напиши функцию, которая принимает список строк и возвращает словарь с ключом - буквой и значением - списком строк.
//
////Начальные значения: val list = listOf(
////    "Стол", "табурет", "ваза", "Кружка", "Зеркало", "ковер", "Шкаф", "часы", "Люстра", "подушка", "Картина", "столик",
////    "Вазон", "шторы", "Пуф", "книга", "Фоторамка", "светильник", "Коврик", "вешалка", "Подставка", "телевизор",
////    "Комод", "полка", "Абажур", "диван", "Кресло", "занавеска", "Бра", "пепельница", "Глобус", "статуэтка", "Поднос",
////    "фигурка", "Ключница", "плед", "Тумба", "игрушка", "Настенные часы", "подсвечник", "Журнальный столик", "сувенир",
////    "Корзина для белья", "посуда", "Настольная лампа", "торшер", "Этажерка" )
////Цель: Привести все слова в списке к нижнему регистру, сгруппировать в каталог по первой букве используя метод groupBy
//
//fun createCatalog(items: List<String>): Map<Char, List<String>> =
//    items
//        .map { it.lowercase() }              // привести все слова к нижнему регистру
//        .groupBy { it.first() }              // сгруппировать по первой букве
//
//fun main() {
//    val list = listOf(
//        "Стол", "табурет", "ваза", "Кружка", "Зеркало", "ковер", "Шкаф", "часы", "Люстра",
//        "подушка", "Картина", "столик", "Вазон", "шторы", "Пуф", "книга", "Фоторамка",
//        "светильник", "Коврик", "вешалка", "Подставка", "телевизор", "Комод", "полка",
//        "Абажур", "диван", "Кресло", "занавеска", "Бра", "пепельница", "Глобус",
//        "статуэтка", "Поднос", "фигурка", "Ключница", "плед", "Тумба", "игрушка",
//        "Настенные часы", "подсвечник", "Журнальный столик", "сувенир",
//        "Корзина для белья", "посуда", "Настольная лампа", "торшер", "Этажерка"
//    )
//    println(createCatalog(list))
//}
//
//
////Задание 27. Подсчёт средней длины слов в списке
////Напиши функцию, которая принимает список строк и возвращает строку.
////Начальные значения взять из предыдущей задачи.
////Цель: Перевести все слова в количество букв, подсчитать среднее значение.
//// Вернуть форматированный текст с двумя знаками после запятой, используя функцию format и подходящий шаблон.
//
//fun averageWordLength(words: List<String>): String {
//    val average = words
//        .map { it.length }   // переводим каждое слово в количество букв
//        .average()           // считаем среднее значение
//
//    return "Средняя длина слов: %.2f".format(average)
//}
//
//fun main() {
//    val list = listOf(
//        "Стол", "табурет", "ваза", "Кружка", "Зеркало", "ковер", "Шкаф", "часы", "Люстра",
//        "подушка", "Картина", "столик", "Вазон", "шторы", "Пуф", "книга", "Фоторамка",
//        "светильник", "Коврик", "вешалка", "Подставка", "телевизор", "Комод", "полка",
//        "Абажур", "диван", "Кресло", "занавеска", "Бра", "пепельница", "Глобус",
//        "статуэтка", "Поднос", "фигурка", "Ключница", "плед", "Тумба", "игрушка",
//        "Настенные часы", "подсвечник", "Журнальный столик", "сувенир",
//        "Корзина для белья", "посуда", "Настольная лампа", "торшер", "Этажерка"
//    )
//    println(averageWordLength(list))
//}
//
////Задание 28: Категоризация чисел
////Напиши функцию, которая принимает список чисел и возвращает словарь с ключами - строками и значениями - список чисел.
////Начальные значения: val numbers = listOf(1, 3, 5, 7, 3, 1, 8, 9, 9, 7)
////Цель: Отобрать уникальные числа, отсортировать по убыванию и сгруппировать по четности (“четные” и “нечетные”).
//
//fun categorizeNumbers(numbers: List<Int>): Map<String, List<Int>> =
//    numbers
//        .distinct()                       // отбираем уникальные числа
//        .sortedDescending()               // сортируем по убыванию
//        .groupBy { if (it % 2 == 0) "четные" else "нечетные" }  // группируем по чётности
//
//fun main() {
//    val numbers = listOf(1, 3, 5, 7, 3, 1, 8, 9, 9, 7)
//    println(categorizeNumbers(numbers))
//}
//
//
////Задание 29: Поиск первого подходящего элемента
////Напиши функцию, которая принимает список чисел и число и возвращает nullable число.
////Начальные значения: val ages = listOf(22, 18, 30, 45, 17, null, 60) и число для проверки возраста, например 18.
////Цель: Найти первый возраст в списке, который соответствует условию (больше второго аргумента) и вернуть его, либо null если значения не нашлось.
//
//fun findFirstOlderThan(ages: List<Int?>, threshold: Int): Int? =
//    ages.firstOrNull { it != null && it > threshold }
//
//fun main() {
//    val ages = listOf(22, 18, 30, 45, 17, null, 60)
//
//    println(findFirstOlderThan(ages, 18))  // 22
//    println(findFirstOlderThan(ages, 45))  // 60
//    println(findFirstOlderThan(ages, 60))  // null
//}